{
  "title": "📘 Detrás de Mi Blog",
  "paragraphs": [
    "Creé esta página para documentar cada paso en la construcción de mi blog \"Support My Journey\" – un espacio donde comparto mis sueños y busco el apoyo solidario de la comunidad.",
    "Desde los primeros días aprendiendo a iniciar un blog, personalizando el diseño, conectando PayPal y configurando el botón de donación... cada paso fue una experiencia valiosa. Quería registrarlo como un recuerdo personal y compartirlo con quienes emprendan un camino similar."
  ],
  "milestones_title": "🗓️ Hitos Clave",
  "milestones": [
    "5 de julio de 2025 – Nació la idea de crear un blog de recaudación de fondos personal.",
    "5 de julio de 2025 – Se creó el sitio en Blogspot para recaudar fondos para equipos y se buscó una plantilla adecuada.",
    "6 de julio de 2025 – Se eligió el nombre del blog \"Support My Journey\".",
    "6 de julio de 2025 – Se diseñó el logotipo y favicon en tonos azul y blanco.",
    "6 de julio de 2025 – Se publicó la primera entrada con el objetivo de recaudación (Logitech G923).",
    "6 de julio de 2025 – Se registró PayPal y se creó el botón de donación.",
    "7 de julio de 2025 – Se integró barra de progreso, historial de donaciones y política de transparencia.",
    "8 de julio de 2025 – Se compró el dominio supportmyjourney.com y se conectó con Blogspot. DNS configurado (Cloudflare).",
    "9 de julio de 2025 – Se añadió soporte multilingüe dentro de los posts y se integró el widget de Google Translate. Optimizado para móviles.",
    "9 de julio de 2025 – Se continuó afinando el sistema de traducción en los posts.",
    "10 de julio de 2025 – Se finalizó el sistema de traducción y se eliminó Google Translate por conflictos.",
    "10 de julio de 2025 – Pausa breve... seguiré con el seguimiento automático de donaciones.",
    "11 de julio de 2025 – Soporte de idioma añadido a páginas de notificación y widget Acerca de.",
    "12 de julio de 2025 – Se solucionaron errores de visualización en pantallas pequeñas.",
    "13 de julio de 2025 – Añadidos idiomas coreano y portugués.",
    "13 de julio de 2025 – El sitio ahora tiene soporte para 8 idiomas (usando traducción automática). El HTML creció mucho, así que migré el contenido a archivos JSON externos (GitHub + Cloudflare Pages).",
    "14 de julio de 2025 – Se solucionaron problemas con el conmutador de idioma, se consolidó en un solo botón con menú desplegable.",
    "15 de julio de 2025 – Optimización SEO realizada para facilitar el descubrimiento del blog.",
    "15 de julio de 2025 – Pruebas del progreso automático de donaciones. Los datos de Google Sheets funcionan, pero PayPal aún debe ingresarse manualmente por seguridad.",
    "20 de julio de 2025 – Se integraron con éxito la barra de progreso automática y el historial de donaciones. Los datos provienen de Google Sheets y están disponibles en 8 idiomas. Actualmente hay datos de prueba (Test 1–9); se actualizarán con donaciones reales."
  ],
  "footer": "Gracias por visitar esta página. Espero que este pequeño viaje te inspire o te brinde ideas útiles. No sé si alcanzaré mis metas, pero al menos quiero que esta web funcione bien."
}
