{
  "title": "📘 Detrás de mi blog",
  "paragraphs": [
    "Creé esta página para documentar cada paso que tomé al construir el blog \"Support My Journey\" – un espacio donde comparto mis sueños y espero recibir apoyo de la comunidad.",
    "Desde aprender a crear un blog, personalizar el diseño, conectar PayPal y configurar el botón de donación... cada paso fue una experiencia significativa. Quería registrar todo como un recordatorio personal y compartirlo con quienes estén en un camino similar."
  ],
  "milestones_title": "🗓️ Hitos clave",
  "milestones": [
    "5 de julio de 2025 – Surgió la idea de crear un blog personal para recaudar fondos.",
    "5 de julio de 2025 – Creación del blog en Blogspot para recaudar fondos para equipos, búsqueda de una plantilla adecuada.",
    "6 de julio de 2025 – Elegí el nombre del blog \"Support My Journey\".",
    "6 de julio de 2025 – Diseñé el logo y el favicon en tonos azul y blanco.",
    "6 de julio de 2025 – Escribí la primera entrada de recaudación de fondos (Logitech G923).",
    "6 de julio de 2025 – Me registré en PayPal y creé el botón de donación.",
    "7 de julio de 2025 – Integré la barra de progreso, el historial de donaciones y la política de transparencia.",
    "8 de julio de 2025 – Compré el dominio supportmyjourney.com y lo conecté a Blogspot. Configuré DNS (Cloudflare) para su correcto funcionamiento.",
    "9 de julio de 2025 – Añadí soporte multilingüe dentro de las entradas junto con el widget de Google Translate, optimizado para móviles.",
    "9 de julio de 2025 – Continué mejorando el sistema multilingüe dentro de las entradas.",
    "10 de julio de 2025 – Finalicé el sistema y desactivé el widget de Google Translate por conflictos.",
    "10 de julio de 2025 – Descanso... Pronto seguiré con el seguimiento automático de donaciones...",
    "11 de julio de 2025 – Añadí traducción a páginas informativas y al widget Acerca de.",
    "12 de julio de 2025 – Corregí errores de visualización en pantallas pequeñas.",
    "13 de julio de 2025 – Añadí coreano y portugués como nuevos idiomas.",
    "13 de julio de 2025 – El sitio ya admite 8 idiomas (traducidos con IA). Esto alargó demasiado el HTML, así que comencé a usar archivos JSON alojados en CDN.",
    "14 de julio de 2025 – Surgieron problemas con el selector de idioma. Lo convertí en un botón con menú desplegable para mayor comodidad.",
    "15 de julio de 2025 – Optimizando SEO para que más personas encuentren el sitio.",
    "15 de julio de 2025 – Probando barra de progreso automática. Lista de donaciones sincronizada con Google Sheets, pero aún ingreso manual desde PayPal por seguridad."
  ],
  "footer": "Gracias por visitar esta página. Espero que este pequeño viaje te inspire o motive de alguna manera."
}
